# Taps
tap 'esolitos/ipa'

# Brews
brew 'aws-cdk'
brew 'awscli'
brew 'block-goose-cli'
brew 'cloudflare-wrangler'
brew 'coreutils'
brew 'direnv'
brew 'doppler'
brew 'eza'
brew 'fzf'
brew 'gh'
brew 'glab'
brew 'gnupg'
brew 'go'
brew 'grep'
brew 'jq'
brew 'kubernetes-cli'
brew 'mas'
brew 'mysql'
brew 'nmap'
brew 'nvm'
brew 'opencode'
brew 'pandoc'
brew 'powerlevel10k'
brew 'pyenv'
brew 'step'
brew 'telnet'
brew 'tfenv'
brew 'tmux'
brew 'uv'
brew 'xdg-ninja'
brew 'zoxide'
brew 'zsh'
brew 'zsh-autosuggestions'
brew 'zsh-syntax-highlighting'
brew 'esolitos/ipa/sshpass'

# Apps
cask '1password'
cask '1password-cli'
cask 'block-goose'
cask 'brave-browser'
cask 'chatgpt'
cask 'cloudflare-warp'
cask 'codex'
cask 'discord'
cask 'docker-desktop'
cask 'firefox'
cask 'ghostty'
cask 'github'
cask 'google-chrome'
cask 'iterm2'
cask 'microsoft-outlook'
cask 'microsoft-teams'
cask 'postman'
cask 'rectangle'
cask 'session-manager-plugin'
cask 'slack'
cask 'sublime-text'
cask 'telegram'
cask 'visual-studio-code'
cask 'vlc'
cask 'vnc-viewer'
cask 'warp'
cask 'webex'
cask 'wireshark-app'
cask 'zoom'

# Mac App Store
mas 'Coin Tick', id: 1141688067
mas 'Prime Video', id: 545519333
mas 'WireGuard', id: 1451685025

# VSCode Extensions
vscode 'esbenp.prettier-vscode'
vscode 'ms-python.python'
vscode 'ms-vsliveshare.vsliveshare'
