# Taps
tap 'homebrew/bundle'
tap 'homebrew/services'
tap 'esolitos/ipa'
tap 'hashicorp/tap'
tap 'fluxcd/tap'

# Brews
brew 'awscli'
brew 'calicoctl'
brew 'cloudflared'
brew 'coreutils'
brew 'eza'
brew 'grep'
brew 'helm'
brew 'jq'
brew 'kubectl'
brew 'mas'
brew 'mysql'
brew 'nmap'
brew 'nvm'
brew 'node'
brew 'npm'
brew 'uv'
brew 'openldap'
brew 'pyenv'
brew 'telnet'
brew 'tfenv'
brew 'xz'
brew 'zsh'
brew 'zplug'
brew 'powerlevel10k'
brew 'zsh-autosuggestions'
brew 'zsh-fast-syntax-highlighting'
brew 'hashicorp/tap/vault'
brew 'openjdk@21'
brew 'kubecolor'
brew 'operator-sdk'
brew 'fluxcd/tap/flux'
brew 'kustomize'
brew 'check-jsonschema'
brew 'sops'
brew 'ffmpeg'
brew 'step'
brew 'rancher-cli'
brew 'doppler'
brew 'glab'
brew 'claude-code'
brew 'prometheus'

# Apps
cask '1password'
cask '1password-cli'
cask 'brave-browser'
cask 'cloudflare-warp'
cask 'discord'
# cask 'docker'
cask 'firefox'
cask 'github'
cask 'google-chrome'
cask 'iterm2'
cask 'microsoft-edge'
cask 'microsoft-outlook'
cask 'microsoft-teams'
cask 'postman'
cask 'rectangle'
cask 'slack'
cask 'spotify'
cask 'visual-studio-code'
# cask 'wireshark'
cask 'zoom'

# Mac App Store
# mas 'forScore', id: 363738376
