# Taps
tap 'homebrew/bundle'
tap 'homebrew/services'
tap 'esolitos/ipa'
tap 'hashicorp/tap'

# Brews
brew 'ansible'
brew 'ansible-lint'
brew 'aws-cdk'
brew 'awscli'
brew 'calicoctl'
brew 'cloudflare-wrangler'
brew 'cloudflared'
brew 'coreutils'
brew 'dive'
brew 'doppler'
brew 'eza'
brew 'gnupg'
brew 'grep'
brew 'helm'
brew 'iperf'
brew 'jq'
brew 'kubernetes-cli'
brew 'mas'
brew 'mysql'
brew 'nvm'
brew 'nmap'
brew 'opencode'
brew 'openldap'
brew 'pyenv'
brew 'step'
brew 'telnet'
brew 'tfenv'
brew 'uv'
brew 'zsh'
brew 'zplug'
brew 'esolitos/ipa/sshpass'
brew 'hashicorp/tap/vault'

# Apps
cask '1password'
cask '1password-cli'
cask 'arc'
cask 'brave-browser'
cask 'chatgpt'
cask 'claude-code'
cask 'cloudflare-warp'
cask 'discord'
cask 'docker-desktop'
cask 'firefox'
cask 'ghostty'
cask 'github'
cask 'iterm2'
cask 'logitech-g-hub'
cask 'microsoft-edge'
cask 'microsoft-excel'
cask 'microsoft-outlook'
cask 'microsoft-powerpoint'
cask 'microsoft-remote-desktop'
cask 'microsoft-teams'
cask 'postman'
cask 'rectangle'
cask 'session-manager-plugin'
cask 'slack'
cask 'spotify'
cask 'spotmenu'
cask 'sublime-text'
cask 'visual-studio-code'
cask 'vlc'
cask 'warp'
cask 'webex'
cask 'wireshark-app'
cask 'zoom'

# Mac App Store
mas 'Coin Tick', id: 1141688067
mas 'forScore', id: 363738376
mas 'Microsoft OneNote', id: 784801555
mas 'Microsoft Word', id: 462054704
mas 'OneDrive', id: 823766827
mas 'Prime Video', id: 545519333
mas 'Spotica Menu', id: 570549457

# VSCode Extensions
vscode 'amazonwebservices.amazon-q-vscode'
vscode 'doppler.doppler-vscode'
vscode 'esbenp.prettier-vscode'
vscode 'ms-azuretools.vscode-containers'
vscode 'ms-python.python'
vscode 'ms-vscode-remote.remote-containers'
vscode 'ms-vsliveshare.vsliveshare'
vscode 'openai.chatgpt'
vscode 'rashwell.tcl'
vscode 'redhat.ansible'
vscode 'redhat.vscode-yaml'
vscode 'rooveterinaryinc.roo-cline'
